avrdudes/avr-libc/include/avr/ioavr32dd20.h
/* Source select bit group configurations*/
typedef enum CLKCTRL_SOURCE_enum
{
    CLKCTRL_SOURCE_OSCHF_gc        = (CLKCTRL_SOURCE_OSCHF_gv << CLKCTRL_SOURCE_bp),  /* High frequency internal oscillator as PLL source */
    CLKCTRL_SOURCE_XOSCHF_gc       = (CLKCTRL_SOURCE_XOSCHF_gv << CLKCTRL_SOURCE_bp)   /* High frequency external clock or external high frequency oscillator as PLL source */
} CLKCTRL_SOURCE_t;

/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V4S

/* CCP signature select bit group values */
typedef enum CCP_VALUES_enum
{
    CCP_SPM_gv                     = 0x9D,  /* SPM Instruction Protection */
    CCP_IOREG_gv                   = 0xD8   /* IO Register Protection */
} CCP_values_t;

/* CCP signature select bit group configurations*/
typedef enum CCP_enum
{
    CCP_SPM_gc                     = (CCP_SPM_gv << CPU_CCP_gp),  /* SPM Instruction Protection */
    CCP_IOREG_gc                   = (CCP_IOREG_gv << CPU_CCP_gp)   /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CPUINT - Interrupt Controller
--------------------------------------------------------------------------
*/

/* Interrupt Controller */
typedef struct CPUINT_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t LVL0PRI;  /* Interrupt Level 0 Priority */
    register8_t LVL1VEC;  /* Interrupt Level 1 Priority Vector */
    register8_t reserved_1[12];
} CPUINT_t;


/*
--------------------------------------------------------------------------
CRCSCAN - CRCSCAN
--------------------------------------------------------------------------
*/

/* CRCSCAN */
typedef struct CRCSCAN_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t STATUS;  /* Status */
    register8_t reserved_1[13];
} CRCSCAN_t;

/* CRC Source select bit group values */
typedef enum CRCSCAN_SRC_VALUES_enum
{
    CRCSCAN_SRC_FLASH_gv           = 0x00,  /* CRC on entire flash */
    CRCSCAN_SRC_BOOTAPP_gv         = 0x01,  /* CRC on boot and appl section of flash */
    CRCSCAN_SRC_BOOT_gv            = 0x02   /* CRC on boot section of flash */
} CRCSCAN_SRC_values_t;

/* CRC Source select bit group configurations*/
typedef enum CRCSCAN_SRC_enum
{
    CRCSCAN_SRC_FLASH_gc           = (CRCSCAN_SRC_FLASH_gv << CRCSCAN_SRC_gp),  /* CRC on entire flash */
    CRCSCAN_SRC_BOOTAPP_gc         = (CRCSCAN_SRC_BOOTAPP_gv << CRCSCAN_SRC_gp),  /* CRC on boot and appl section of flash */
    CRCSCAN_SRC_BOOT_gc            = (CRCSCAN_SRC_BOOT_gv << CRCSCAN_SRC_gp)   /* CRC on boot section of flash */
} CRCSCAN_SRC_t;

/*
--------------------------------------------------------------------------
DAC - Digital to Analog Converter
--------------------------------------------------------------------------
*/

/* Digital to Analog Converter */
typedef struct DAC_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t reserved_1[1];
    _WORDREGISTER(DATA);  /* DATA Register */
} DAC_t;


/*
--------------------------------------------------------------------------
EVSYS - Event System
--------------------------------------------------------------------------
*/

/* Event System */
typedef struct EVSYS_struct
{
    register8_t SWEVENTA;  /* Software Event A */
    register8_t SWEVENTB;  /* Software Event B */
    register8_t reserved_1[14];
    register8_t CHANNEL0;  /* Multiplexer Channel 0 */
    register8_t CHANNEL1;  /* Multiplexer Channel 1 */
    register8_t CHANNEL2;  /* Multiplexer Channel 2 */
    register8_t CHANNEL3;  /* Multiplexer Channel 3 */
    register8_t CHANNEL4;  /* Multiplexer Channel 4 */
    register8_t CHANNEL5;  /* Multiplexer Channel 5 */
    register8_t reserved_2[10];
    register8_t USERCCLLUT0A;  /* User 0 - CCL0 Event A */
    register8_t USERCCLLUT0B;  /* User 1 - CCL0 Event B */
    register8_t USERCCLLUT1A;  /* User 2 - CCL1 Event A */
    register8_t USERCCLLUT1B;  /* User 3 - CCL1 Event B */
    register8_t USERCCLLUT2A;  /* User 4 - CCL2 Event A */
    register8_t USERCCLLUT2B;  /* User 5 - CCL2 Event B */
    register8_t USERCCLLUT3A;  /* User 6 - CCL3 Event A */
    register8_t USERCCLLUT3B;  /* User 7 - CCL3 Event B */
    register8_t USERADC0START;  /* User 12 - ADC0 */
    register8_t USEREVSYSEVOUTA;  /* User 13 - EVOUTA */
    register8_t USEREVSYSEVOUTC;  /* User 15 - EVOUTC */
    register8_t USEREVSYSEVOUTD;  /* User 16 - EVOUTD */
    register8_t USEREVSYSEVOUTF;  /* User 18 - EVOUTF */
    register8_t USERUSART0IRDA;  /* User 20 - USART0 */
    register8_t USERUSART1IRDA;  /* User 21 - USART1 */
    register8_t USERTCA0CNTA;  /* User 26 - TCA0 Event A */
    register8_t USERTCA0CNTB;  /* User 27 - TCA0 Event B */
    register8_t USERTCB0CAPT;  /* User 30 - TCB0 Event A */
    register8_t USERTCB0COUNT;  /* User 31 - TCB0 Event B */
    register8_t USERTCB1CAPT;  /* User 32 - TCB1 Event A */
    register8_t USERTCB1COUNT;  /* User 33 - TCB1 Event B */
    register8_t USERTCB2CAPT;  /* User 34 - TCB2 Event A */
    register8_t USERTCB2COUNT;  /* User 35 - TCB2 Event B */
    register8_t USERTCD0INPUTA;  /* User 40 - TCD0 Event A */
    register8_t USERTCD0INPUTB;  /* User 41 - TCD0 Event B */
    register8_t reserved_3[7];
} EVSYS_t;

/* Channel 0 generator select bit group values */
typedef enum EVSYS_CHANNEL0_VALUES_enum
{
    EVSYS_CHANNEL0_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL0_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL0_MVIO_gv         = 0x05,  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL0_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL0_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL0_RTC_PIT_DIV8192_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL0_RTC_PIT_DIV4096_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL0_RTC_PIT_DIV2048_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL0_RTC_PIT_DIV1024_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL0_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL0_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL0_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL0_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL0_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL0_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL0_ZCD3_gv         = 0x30,  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL0_PORTA_PIN0_gv   = 0x40,  /* Port A Pin 0 */
    EVSYS_CHANNEL0_PORTA_PIN1_gv   = 0x41,  /* Port A Pin 1 */
    EVSYS_CHANNEL0_PORTA_PIN2_gv   = 0x42,  /* Port A Pin 2 */
    EVSYS_CHANNEL0_PORTA_PIN3_gv   = 0x43,  /* Port A Pin 3 */
    EVSYS_CHANNEL0_PORTA_PIN4_gv   = 0x44,  /* Port A Pin 4 */
    EVSYS_CHANNEL0_PORTA_PIN5_gv   = 0x45,  /* Port A Pin 5 */
    EVSYS_CHANNEL0_PORTA_PIN6_gv   = 0x46,  /* Port A Pin 6 */
    EVSYS_CHANNEL0_PORTA_PIN7_gv   = 0x47,  /* Port A Pin 7 */
    EVSYS_CHANNEL0_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL0_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL0_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL0_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL0_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL0_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL0_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL0_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL0_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL0_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL0_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL0_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL0_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL0_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL0_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL0_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL0_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL0_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL0_values_t;

/* Channel 0 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL0_enum
{
    EVSYS_CHANNEL0_OFF_gc          = (EVSYS_CHANNEL0_OFF_gv << EVSYS_CHANNEL0_gp),  /* Off */
    EVSYS_CHANNEL0_UPDI_SYNCH_gc   = (EVSYS_CHANNEL0_UPDI_SYNCH_gv << EVSYS_CHANNEL0_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL0_MVIO_gc         = (EVSYS_CHANNEL0_MVIO_gv << EVSYS_CHANNEL0_gp),  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL0_RTC_OVF_gc      = (EVSYS_CHANNEL0_RTC_OVF_gv << EVSYS_CHANNEL0_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL0_RTC_CMP_gc      = (EVSYS_CHANNEL0_RTC_CMP_gv << EVSYS_CHANNEL0_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL0_RTC_PIT_DIV8192_gc = (EVSYS_CHANNEL0_RTC_PIT_DIV8192_gv << EVSYS_CHANNEL0_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL0_RTC_PIT_DIV4096_gc = (EVSYS_CHANNEL0_RTC_PIT_DIV4096_gv << EVSYS_CHANNEL0_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL0_RTC_PIT_DIV2048_gc = (EVSYS_CHANNEL0_RTC_PIT_DIV2048_gv << EVSYS_CHANNEL0_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL0_RTC_PIT_DIV1024_gc = (EVSYS_CHANNEL0_RTC_PIT_DIV1024_gv << EVSYS_CHANNEL0_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL0_CCL_LUT0_gc     = (EVSYS_CHANNEL0_CCL_LUT0_gv << EVSYS_CHANNEL0_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL0_CCL_LUT1_gc     = (EVSYS_CHANNEL0_CCL_LUT1_gv << EVSYS_CHANNEL0_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL0_CCL_LUT2_gc     = (EVSYS_CHANNEL0_CCL_LUT2_gv << EVSYS_CHANNEL0_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL0_CCL_LUT3_gc     = (EVSYS_CHANNEL0_CCL_LUT3_gv << EVSYS_CHANNEL0_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL0_AC0_OUT_gc      = (EVSYS_CHANNEL0_AC0_OUT_gv << EVSYS_CHANNEL0_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL0_ADC0_RESRDY_gc  = (EVSYS_CHANNEL0_ADC0_RESRDY_gv << EVSYS_CHANNEL0_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL0_ZCD3_gc         = (EVSYS_CHANNEL0_ZCD3_gv << EVSYS_CHANNEL0_gp),  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL0_PORTA_PIN0_gc   = (EVSYS_CHANNEL0_PORTA_PIN0_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 0 */
    EVSYS_CHANNEL0_PORTA_PIN1_gc   = (EVSYS_CHANNEL0_PORTA_PIN1_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 1 */
    EVSYS_CHANNEL0_PORTA_PIN2_gc   = (EVSYS_CHANNEL0_PORTA_PIN2_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 2 */
    EVSYS_CHANNEL0_PORTA_PIN3_gc   = (EVSYS_CHANNEL0_PORTA_PIN3_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 3 */
    EVSYS_CHANNEL0_PORTA_PIN4_gc   = (EVSYS_CHANNEL0_PORTA_PIN4_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 4 */
    EVSYS_CHANNEL0_PORTA_PIN5_gc   = (EVSYS_CHANNEL0_PORTA_PIN5_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 5 */
    EVSYS_CHANNEL0_PORTA_PIN6_gc   = (EVSYS_CHANNEL0_PORTA_PIN6_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 6 */
    EVSYS_CHANNEL0_PORTA_PIN7_gc   = (EVSYS_CHANNEL0_PORTA_PIN7_gv << EVSYS_CHANNEL0_gp),  /* Port A Pin 7 */
    EVSYS_CHANNEL0_USART0_XCK_gc   = (EVSYS_CHANNEL0_USART0_XCK_gv << EVSYS_CHANNEL0_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL0_USART1_XCK_gc   = (EVSYS_CHANNEL0_USART1_XCK_gv << EVSYS_CHANNEL0_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL0_SPI0_SCK_gc     = (EVSYS_CHANNEL0_SPI0_SCK_gv << EVSYS_CHANNEL0_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL0_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL0_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL0_TCA0_HUNF_gc    = (EVSYS_CHANNEL0_TCA0_HUNF_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL0_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL0_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL0_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL0_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL0_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL0_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL0_TCB0_CAPT_gc    = (EVSYS_CHANNEL0_TCB0_CAPT_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL0_TCB0_OVF_gc     = (EVSYS_CHANNEL0_TCB0_OVF_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL0_TCB1_CAPT_gc    = (EVSYS_CHANNEL0_TCB1_CAPT_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL0_TCB1_OVF_gc     = (EVSYS_CHANNEL0_TCB1_OVF_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL0_TCB2_CAPT_gc    = (EVSYS_CHANNEL0_TCB2_CAPT_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL0_TCB2_OVF_gc     = (EVSYS_CHANNEL0_TCB2_OVF_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL0_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL0_TCD0_CMPBCLR_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL0_TCD0_CMPASET_gc = (EVSYS_CHANNEL0_TCD0_CMPASET_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL0_TCD0_CMPBSET_gc = (EVSYS_CHANNEL0_TCD0_CMPBSET_gv << EVSYS_CHANNEL0_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL0_TCD0_PROGEV_gc  = (EVSYS_CHANNEL0_TCD0_PROGEV_gv << EVSYS_CHANNEL0_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL0_t;

/* Channel 1 generator select bit group values */
typedef enum EVSYS_CHANNEL1_VALUES_enum
{
    EVSYS_CHANNEL1_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL1_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL1_MVIO_gv         = 0x05,  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL1_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL1_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL1_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL1_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL1_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL1_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL1_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL1_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL1_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL1_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL1_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL1_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL1_ZCD3_gv         = 0x30,  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL1_PORTA_PIN0_gv   = 0x40,  /* Port A Pin 0 */
    EVSYS_CHANNEL1_PORTA_PIN1_gv   = 0x41,  /* Port A Pin 1 */
    EVSYS_CHANNEL1_PORTA_PIN2_gv   = 0x42,  /* Port A Pin 2 */
    EVSYS_CHANNEL1_PORTA_PIN3_gv   = 0x43,  /* Port A Pin 3 */
    EVSYS_CHANNEL1_PORTA_PIN4_gv   = 0x44,  /* Port A Pin 4 */
    EVSYS_CHANNEL1_PORTA_PIN5_gv   = 0x45,  /* Port A Pin 5 */
    EVSYS_CHANNEL1_PORTA_PIN6_gv   = 0x46,  /* Port A Pin 6 */
    EVSYS_CHANNEL1_PORTA_PIN7_gv   = 0x47,  /* Port A Pin 7 */
    EVSYS_CHANNEL1_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL1_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL1_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL1_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL1_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL1_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL1_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL1_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL1_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL1_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL1_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL1_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL1_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL1_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL1_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL1_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL1_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL1_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL1_values_t;

/* Channel 1 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL1_enum
{
    EVSYS_CHANNEL1_OFF_gc          = (EVSYS_CHANNEL1_OFF_gv << EVSYS_CHANNEL1_gp),  /* Off */
    EVSYS_CHANNEL1_UPDI_SYNCH_gc   = (EVSYS_CHANNEL1_UPDI_SYNCH_gv << EVSYS_CHANNEL1_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL1_MVIO_gc         = (EVSYS_CHANNEL1_MVIO_gv << EVSYS_CHANNEL1_gp),  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL1_RTC_OVF_gc      = (EVSYS_CHANNEL1_RTC_OVF_gv << EVSYS_CHANNEL1_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL1_RTC_CMP_gc      = (EVSYS_CHANNEL1_RTC_CMP_gv << EVSYS_CHANNEL1_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL1_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV512_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL1_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV256_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL1_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV128_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL1_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV64_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL1_CCL_LUT0_gc     = (EVSYS_CHANNEL1_CCL_LUT0_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL1_CCL_LUT1_gc     = (EVSYS_CHANNEL1_CCL_LUT1_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL1_CCL_LUT2_gc     = (EVSYS_CHANNEL1_CCL_LUT2_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL1_CCL_LUT3_gc     = (EVSYS_CHANNEL1_CCL_LUT3_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL1_AC0_OUT_gc      = (EVSYS_CHANNEL1_AC0_OUT_gv << EVSYS_CHANNEL1_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL1_ADC0_RESRDY_gc  = (EVSYS_CHANNEL1_ADC0_RESRDY_gv << EVSYS_CHANNEL1_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL1_ZCD3_gc         = (EVSYS_CHANNEL1_ZCD3_gv << EVSYS_CHANNEL1_gp),  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL1_PORTA_PIN0_gc   = (EVSYS_CHANNEL1_PORTA_PIN0_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 0 */
    EVSYS_CHANNEL1_PORTA_PIN1_gc   = (EVSYS_CHANNEL1_PORTA_PIN1_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 1 */
    EVSYS_CHANNEL1_PORTA_PIN2_gc   = (EVSYS_CHANNEL1_PORTA_PIN2_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 2 */
    EVSYS_CHANNEL1_PORTA_PIN3_gc   = (EVSYS_CHANNEL1_PORTA_PIN3_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 3 */
    EVSYS_CHANNEL1_PORTA_PIN4_gc   = (EVSYS_CHANNEL1_PORTA_PIN4_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 4 */
    EVSYS_CHANNEL1_PORTA_PIN5_gc   = (EVSYS_CHANNEL1_PORTA_PIN5_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 5 */
    EVSYS_CHANNEL1_PORTA_PIN6_gc   = (EVSYS_CHANNEL1_PORTA_PIN6_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 6 */
    EVSYS_CHANNEL1_PORTA_PIN7_gc   = (EVSYS_CHANNEL1_PORTA_PIN7_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 7 */
    EVSYS_CHANNEL1_USART0_XCK_gc   = (EVSYS_CHANNEL1_USART0_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL1_USART1_XCK_gc   = (EVSYS_CHANNEL1_USART1_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL1_SPI0_SCK_gc     = (EVSYS_CHANNEL1_SPI0_SCK_gv << EVSYS_CHANNEL1_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL1_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL1_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL1_TCA0_HUNF_gc    = (EVSYS_CHANNEL1_TCA0_HUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL1_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL1_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL1_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL1_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL1_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL1_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL1_TCB0_CAPT_gc    = (EVSYS_CHANNEL1_TCB0_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL1_TCB0_OVF_gc     = (EVSYS_CHANNEL1_TCB0_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL1_TCB1_CAPT_gc    = (EVSYS_CHANNEL1_TCB1_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL1_TCB1_OVF_gc     = (EVSYS_CHANNEL1_TCB1_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL1_TCB2_CAPT_gc    = (EVSYS_CHANNEL1_TCB2_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL1_TCB2_OVF_gc     = (EVSYS_CHANNEL1_TCB2_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL1_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL1_TCD0_CMPBCLR_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL1_TCD0_CMPASET_gc = (EVSYS_CHANNEL1_TCD0_CMPASET_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL1_TCD0_CMPBSET_gc = (EVSYS_CHANNEL1_TCD0_CMPBSET_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL1_TCD0_PROGEV_gc  = (EVSYS_CHANNEL1_TCD0_PROGEV_gv << EVSYS_CHANNEL1_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL1_t;

